TexasInstruments/enet-firmware/apps/app_remoteswitchcfg_client/sitara/am62dx-evm/mcu-r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Dx" --part "AM62D24-G" --package "ANF" --context "mcu-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62D-Q1" --package "FCBGA (ANF)" --variant "AM62D24-G" --context "mcu-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.0+4150"}
 */
scripting.excludeFromBuild("ti_enet_open_close.c");
scripting.excludeFromBuild("ti_enet_lwipif.c");
scripting.excludeFromBuild("ti_enet_lwipif.h");

/**
 * Import the modules used in this configuration.
 */
const eeprom      = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1     = eeprom.addInstance();
const ipc         = scripting.addModule("/drivers/ipc/ipc");
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const mpu_armv78  = mpu_armv7.addInstance();
const mpu_armv79  = mpu_armv7.addInstance();
const mpu_armv710 = mpu_armv7.addInstance();
const enet_cpsw   = scripting.addModule("/networking/enet_cpsw/enet_cpsw", {}, false);
const enet_cpsw1  = enet_cpsw.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

const i2c                = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1               = i2c.addInstance({}, false);
i2c1.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c1;
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

ipc.c75ss0_0 = "NONE";

debug_log.enableUartLog = true;
debug_log.uartTrace     = true;
debug_log.uartLog.$name = "CONFIG_UART0";

mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;
mpu_armv71.$name             = "CONFIG_MPU_REGISTER";

mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.$name             = "CONFIG_MPU_TCMA";

mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.$name             = "CONFIG_MPU_TCMB";

mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x79100000;
mpu_armv74.size              = 19;
mpu_armv74.$name             = "CONFIG_MPU_MCU_MSRAM";

mpu_armv75.$name             = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr          = 0x60000000;
mpu_armv75.size              = 28;
mpu_armv75.accessPermissions = "Supervisor RD, User RD";

mpu_armv76.baseAddr = 0x80000000;
mpu_armv76.size     = 31;
mpu_armv76.$name    = "CONFIG_MPU_DDR";

mpu_armv77.$name      = "CONFIG_MPU_RTOS_VRING1";
mpu_armv77.baseAddr   = 0x9B500000;
mpu_armv77.size       = 20;
mpu_armv77.attributes = "NonCached";

mpu_armv78.$name        = "CONFIG_MPU_RTOS_VRING2";
mpu_armv78.baseAddr     = 0x9B600000;
mpu_armv78.size         = 21;
mpu_armv78.allowExecute = false;
mpu_armv78.attributes   = "NonCached";

mpu_armv79.$name        = "CONFIG_MPU_LINUX_VRING";
mpu_armv79.baseAddr     = 0x9B800000;
mpu_armv79.size         = 20;
mpu_armv79.attributes   = "NonCached";
mpu_armv79.allowExecute = false;

mpu_armv710.$name        = "CONFIG_MPU_RESOURCE_TABLE_AND_TRACE";
mpu_armv710.baseAddr     = 0x9B900000;
mpu_armv710.size         = 20;
mpu_armv710.attributes   = "NonCached";
mpu_armv710.allowExecute = false;

enet_cpsw1.$name                  = "CONFIG_ENET_CPSW0";
enet_cpsw1.PktInfoOnlyEnable      = true;
enet_cpsw1.RGMII1.RD0.$used       = false;
enet_cpsw1.RGMII1.RD1.$used       = false;
enet_cpsw1.RGMII1.RD2.$used       = false;
enet_cpsw1.RGMII1.RD3.$used       = false;
enet_cpsw1.RGMII1.RX_CTL.$used    = false;
enet_cpsw1.RGMII1.RXC.$used       = false;
enet_cpsw1.RGMII1.TD0.$used       = false;
enet_cpsw1.RGMII1.TD1.$used       = false;
enet_cpsw1.RGMII1.TD2.$used       = false;
enet_cpsw1.RGMII1.TD3.$used       = false;
enet_cpsw1.RGMII1.TX_CTL.$used    = false;
enet_cpsw1.RGMII1.TXC.$used       = false;
enet_cpsw1.RGMII2.RD0.$used       = false;
enet_cpsw1.RGMII2.RD1.$used       = false;
enet_cpsw1.RGMII2.RD2.$used       = false;
enet_cpsw1.RGMII2.RD3.$used       = false;
enet_cpsw1.RGMII2.RX_CTL.$used    = false;
enet_cpsw1.RGMII2.RXC.$used       = false;
enet_cpsw1.RGMII2.TD0.$used       = false;
enet_cpsw1.RGMII2.TD1.$used       = false;
enet_cpsw1.RGMII2.TD2.$used       = false;
enet_cpsw1.RGMII2.TD3.$used       = false;
enet_cpsw1.RGMII2.TX_CTL.$used    = false;
enet_cpsw1.RGMII2.TXC.$used       = false;
enet_cpsw1.txDmaChannel[0].$name  = "ENET_DMA_TX_CH0";
enet_cpsw1.rxDmaChannel[0].$name  = "ENET_DMA_RX_CH0";
enet_cpsw1.netifInstance.create(1);
enet_cpsw1.netifInstance[0].$name = "NETIF_INST_ID0";

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg2;

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
enet_cpsw1.udmaDrv = udma1;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.MCU_I2C.$suggestSolution                   = "MCU_I2C0";
i2c1.MCU_I2C.SCL.$suggestSolution               = "MCU_I2C0_SCL";
i2c1.MCU_I2C.SDA.$suggestSolution               = "MCU_I2C0_SDA";
debug_log.uartLog.MCU_UART.$suggestSolution     = "MCU_USART0";
debug_log.uartLog.MCU_UART.RXD.$suggestSolution = "MCU_UART0_RXD";
debug_log.uartLog.MCU_UART.TXD.$suggestSolution = "MCU_UART0_TXD";
enet_cpsw1.MDIO.$suggestSolution                = "MDIO0";
enet_cpsw1.MDIO.MDC.$suggestSolution            = "MDIO0_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution           = "MDIO0_MDIO";
enet_cpsw1.RGMII1.$suggestSolution              = "RGMII2";
enet_cpsw1.RGMII2.$suggestSolution              = "RGMII1";
